[
  "Put on a blindfold and try to apply blush without a mirror.",
  "Put on a pair of shoes on the wrong feet and wear them for 30 minutes.",
  "Take a video of yourself doing the chicken dance and post it on social media.",
  "Share your most embarrassing pet name for a significant other.",
  "Take a video of yourself attempting to do a backflip (safely, of course!).",
  "Wear oven mitts and try to eat a piece of cake or pizza.",
  "Try to do the splits (or your best attempt).",
  "Take a video of yourself doing the Macarena and share it with everyone.",
  "Attempt to speak with your mouth closed while the group guesses what you're saying.",
  "Share a cringeworthy selfie that you never thought you'd show anyone.",
  "Put on a blindfold and try to eat spaghetti without making a mess.",
  "Wear a funny hat and tell everyone you're the party's court jester.",
  "Call a friend and sing \"Baby Got Back\" by Sir Mix-a-Lot.",
  "Use your elbows to text a message to your crush (make it something funny).",
  "Use a hairbrush as a microphone and perform a karaoke song in front of the group.",
  "Attempt to breakdance (or do any dance move) in the middle of the room.",
  "Wear a t-shirt with a funny and embarrassing slogan on it for an hour.",
  "Call a pizza place and confess your undying love for their pizza.",
  "Share an embarrassing moment from a family vacation or trip with friends.",
  "Put on a blindfold and attempt to eat a piece of fruit with a fork and knife.",
  "Take a video of yourself pretending to be a contortionist.",
  "Pretend to be a chicken and cluck loudly for 1 minute.",
  "Share an embarrassing moment from a public speaking engagement or presentation.",
  "Share an embarrassing story from a job interview or job-related event.",
  "Put on a blindfold and try to make a sandwich without a recipe.",
  "Wear your clothes inside-out for the rest of the party.",
  "Share an embarrassing story about sending a text or email to the wrong person.",
  "Share an embarrassing moment from a school presentation or public speaking event.",
  "Share an embarrassing story about a wardrobe malfunction at an important event.",
  "Wear a silly hat and introduce yourself as \"Captain [Your Name]\" for the rest of the party.",
  "Take a video of yourself trying to do the worm dance move.",
  "Talk in a baby voice and refer to yourself in the third person for 10 minutes.",
  "Put on a blindfold and try to draw a self-portrait.",
  "Share an embarrassing moment from a family gathering or holiday celebration.",
  "Take a video of yourself singing a nursery rhyme and share it with the group.",
  "Attempt to do an impression of a famous actor but with your mouth closed.",
  "Put on a blindfold and try to apply mascara without a mirror.",
  "Use a funny filter on your face for the rest of the party.",
  "Share an embarrassing moment involving a wardrobe malfunction.",
  "Wear a pair of mismatched shoes for the rest of the party.",
  "Wear a pair of sunglasses and pretend you're a celebrity avoiding the paparazzi.",
  "Share an embarrassing moment from a family dinner or holiday meal.",
  "Draw an embarrassing caricature of yourself and post it on social media.",
  "Wear a pair of fake vampire teeth for the next 20 minutes.",
  "Put on a blindfold and try to apply eyeliner without a mirror.",
  "Put on a blindfold and attempt to apply foundation without a mirror.",
  "Attempt to do a cartwheel but end up stumbling.",
  "Share the most embarrassing thing you've ever said to your boss or teacher.",
  "Wear socks on your hands and try to do everyday tasks for the next 10 minutes.",
  "Post an embarrassing photo from your past on your social media account.",
  "Put on a blindfold and try to dance like a ballerina for 1 minute.",
  "Attempt to do a handstand against the wall but end up falling down.",
  "Put on a blindfold and let someone else give you a makeover.",
  "Do your best impression of an opera singer for 1 minute.",
  "Make up a funny, embarrassing rap about one of the other players and perform it.",
  "Speak in pig Latin for the next 10 minutes.",
  "Share an embarrassing moment from a sports or physical activity mishap.",
  "Put on a blindfold and let someone else style your hair.",
  "Attempt to speak while inhaling instead of exhaling.",
  "Pretend to be a fortune teller and give random fortunes to other guests.",
  "Stand up and do a dramatic monologue about the last time you were embarrassed.",
  "Call your parents and sing \"I'm a Little Teapot\" to them.",
  "Attempt to lick your elbow again (you know it's impossible, but it's always amusing!).",
  "Take a video of yourself doing the conga dance and share it with everyone.",
  "Attempt to speak while pinching your nose closed.",
  "Pretend to be a televangelist and give a dramatic and over-the-top sermon.",
  "Put on a blindfold and try to apply lipstick without a mirror.",
  "Speak in a baby voice for the next 5 minutes.",
  "Share an embarrassing story about your first crush.",
  "Share an embarrassing childhood story with the group.",
  "Wear a sock puppet on one hand and have a conversation with yourself.",
  "Call a random number and try to keep the conversation going for as long as possible.",
  "Share a cringe-worthy pickup line with the group.",
  "Tell a secret you've never shared with anyone before.",
  "Wear a funny t-shirt with a quirky and embarrassing saying on it.",
  "Wear a funny mask and introduce yourself as a made-up superhero.",
  "Put on a blindfold and attempt to do the limbo dance.",
  "Take a picture of yourself with a silly expression and set it as your profile picture for a day.",
  "Wear a sign that says \"Ask me for a hug\" for the next 15 minutes.",
  "Share an embarrassing moment from a school or work party.",
  "Share an embarrassing story about accidentally sending a text about someone to that person.",
  "Make up a silly and embarrassing cheerleading routine for one of the other players.",
  "Call a friend and sing \"I Will Always Love You\" by Whitney Houston.",
  "Make a video of yourself trying to moonwalk, even if you're not very good at it.",
  "Call a local store and ask if they sell unicorn food.",
  "Speak in a British accent with a lisp for the next 10 minutes.",
  "Attempt to sing a song with your mouth filled with water.",
  "Attempt to speak like a robot with a sore throat for 5 minutes.",
  "Share the most embarrassing thing that happened to you on a date.",
  "Wear a pair of swim goggles for the next 20 minutes for no reason.",
  "Share an embarrassing moment from a social media post or comment.",
  "Wear a bib and pretend you're a messy eater for the next 15 minutes.",
  "Wear a diaper on the outside of your pants for 20 minutes.",
  "Pretend to be a mime and act out an embarrassing situation without speaking.",
  "Call a random contact from your phone and sing \"Happy Birthday\" to them, even if it's not their birthday.",
  "Text your crush or a celebrity a confession of admiration (even if it's not true).",
  "Tell a cheesy joke to the group and act it out.",
  "Put on a blindfold and try to feed yourself a spoonful of whipped cream.",
  "Sing the alphabet while doing silly dance moves for each letter.",
  "Wear a sign that says \"I do silly dances for tips\" for 15 minutes."
]