[
  "Put on a blindfold and try to apply mascara accurately.",
  "Sing \"Happy Birthday\" to the next person who enters the room, even if it's not their birthday.",
  "Talk without moving your lips for the next 2 rounds.",
  "Speak in a whisper for the next 5 minutes.",
  "Write a short rap about something that happened at the party.",
  "Do your best impression of a cat meowing.",
  "Use your knees to text a message to a friend.",
  "Sing the chorus of a song using only \"la la la\" as lyrics.",
  "Put on a blindfold and try to apply eyeliner accurately.",
  "Speak in a British accent for the next 10 minutes.",
  "Take a funny selfie with your eyes crossed.",
  "Wear a silly hat for the next 3 rounds.",
  "Take a funny selfie with a goofy filter.",
  "Send a random text message to one of your contacts.",
  "Do the chicken dance in front of everyone.",
  "Try to make the group laugh without speaking, only using facial expressions.",
  "Try to stand on one leg for as long as you can.",
  "Act out a funny animal video for the group.",
  "Dance like nobody's watching for 30 seconds.",
  "Try to lick your nose with your tongue.",
  "Do the twist dance for 1 minute.",
  "Balance a spoon on your nose and try to catch a grape thrown in the air.",
  "Try to juggle three items (e.g., balls, oranges, or socks).",
  "Do 10 push-ups right now.",
  "Give a piggyback ride to the person on your right.",
  "Do your best impression of a cartoon villain for 1 minute.",
  "Do your best impression of a baby crying.",
  "Do your best impression of a famous movie character.",
  "Use your feet to text a message to a friend.",
  "Draw a funny picture of one of the other players and show it to everyone.",
  "Take a picture of yourself making a silly face and send it to a friend.",
  "Wear socks on your hands for the next 5 minutes.",
  "Speak in slow motion for the next two rounds.",
  "Wear your clothes backward for the next hour.",
  "Talk in a high-pitched voice for the next 5 minutes.",
  "Do your best impression of a baby laughing.",
  "Put on a blindfold and try to feed yourself a snack.",
  "Balance a spoon on your nose and try to do a silly dance.",
  "Recite the alphabet backward as fast as you can.",
  "Balance a spoon on your nose and walk across the room without dropping it.",
  "Act out a famous movie scene with a partner.",
  "Put on a blindfold and try to put on a shirt correctly.",
  "Do your best impression of a cartoon character for 1 minute.",
  "Use a silly voice and order a pizza for everyone.",
  "Wear sunglasses inside for the next hour.",
  "Try to hula hoop for 1 minute.",
  "Give a piggyback ride to the person on your left.",
  "Put on a blindfold and try to draw a picture of a unicorn.",
  "Try to lick your elbow (it's impossible, but fun to watch!).",
  "Wrap yourself in toilet paper like a mummy.",
  "Wear oven mitts and try to eat a piece of candy.",
  "Take a funny selfie with a random stranger (with their permission).",
  "Balance a spoon on your nose for as long as you can.",
  "Wear a fake mustache for the rest of the party.",
  "Put on a blindfold and try to apply lipstick accurately.",
  "Draw a caricature of one of the other players and show it to everyone.",
  "Try to do a cartwheel (if the space allows it).",
  "Let the group give you a new nickname and use it for the rest of the party.",
  "Put a piece of bubblegum in your mouth and try to blow a bubble.",
  "Dance like a robot for 1 minute.",
  "Do the floss dance for 1 minute.",
  "Speak in rhymes for the next three rounds.",
  "Wear a piece of clothing backward for the rest of the party.",
  "Act like a news anchor reporting on a funny event.",
  "Draw a picture blindfolded and let the group guess what it is.",
  "Put on a blindfold and try to identify three different objects just by touch.",
  "Text your best friend using only emojis for the next 5 minutes.",
  "Sing a song in a funny voice.",
  "Take a shot of a mixed drink created by the other players.",
  "Take a silly selfie with the silliest face you can make.",
  "Call a pizza place and order a burger.",
  "Take a funny selfie and post it on your social media account.",
  "Act out your favorite movie scene in less than one minute.",
  "Do your best impression of a famous celebrity for 1 minute.",
  "Spin around 10 times and try to walk in a straight line afterward.",
  "Take a funny selfie with your tongue sticking out.",
  "Talk in slow motion for the next two rounds.",
  "Speak in a silly accent for the next 10 minutes.",
  "Use a funny filter on your face while recording a short video message.",
  "Take a picture of your silliest face and set it as your profile picture for a day.",
  "Wear a funny mask for the next 10 minutes.",
  "Make up a short, funny song about the host of the party and perform it.",
  "Use your elbows to type a social media status update.",
  "Wear a funny t-shirt for the rest of the party.",
  "Put on a blindfold and try to identify different sodas by taste.",
  "Do your best impression of a robot dancing.",
  "Do a handstand against the wall for 10 seconds.",
  "Take a bite out of a lemon without making a sour face.",
  "Draw a self-portrait with your eyes closed.",
  "Take a picture of yourself doing a funny yoga pose.",
  "Do your best impression of a monkey for 1 minute.",
  "Speak in a foreign accent for the next 10 minutes.",
  "Speak in a deep voice for the next 5 minutes.",
  "Talk like a robot for the next 5 minutes.",
  "Act out a famous commercial for a product of your choice.",
  "Write a funny limerick about yourself and recite it to the group.",
  "Do the moonwalk across the room.",
  "Put a piece of ice down your shirt and keep it there for 1 minute.",
  "Put on a puppet show with items you find around the house.",
  "Use your elbows to text a message to a friend."
]