[
  "I am a word of five letters and people eat me. If you remove the first letter I become a form of energy. Remove the first two and I'm needed to live. Scramble the last 3 and you can drink me. What am I? (Wheat)",
  "What goes up and down, but always remains in the same place? (Stairs)",
  "You walk into a room that contains a match, a kerosene lamp, a candle and a fireplace. What would you light first? (The match)",
  "What kind of coat is always wet when you put it on? (A coat of paint)",
  "What occurs twice in a week, once in a year but never in a day? (The letter 'e')",
  "What can you catch but not throw? (A cold)",
  "What has cities, but no houses; forests, but no trees; and rivers, but no water? (A map)",
  "What has four wheels and flies? (A garbage truck)",
  "I have one letter but my name is spelled with eight. What am I? (Envelope)",
  "What gets wetter the more it dries? (A towel)",
  "I'm not alive, but I can grow; I don't have lungs, but I need air; I don't have a mouth, but water kills me. What am I? (Fire)",
  "What comes down but never goes up? (Rain)",
  "What gets bigger and bigger the more you take away from it? (A hole)",
  "What has a heart that doesn’t beat? (An artichoke)",
  "What can you break, even if you never pick it up or touch it? (A promise)",
  "What goes up and never comes down? (Your age)",
  "What is made of water but if you put it into water it will die? (An ice cube)",
  "What can run but never walks, has a mouth but never talks, has a head but never weeps, has a bed but never sleeps? (A river)",
  "What needs an answer but doesn’t ask a question? (A telephone)",
  "What can fill a room but takes up no space? (Light)",
  "What has one eye but cannot see? (A needle)",
  "What has words but never speaks? (A book)",
  "What has a bark but no bite? (A tree)",
  "What is always coming but never arrives? (Tomorrow)",
  "What has one head, one foot, and four legs? (A bed)",
  "I am so simple, that I can only point yet I guide men all over the world. What am I? (A compass)",
  "What kind of coat can only be put on when wet? (A coat of paint)",
  "What has a thumb and four fingers but is not alive? (A glove)",
  "What is it that if you have, you want to share me, and if you share, you do not have? (A secret)",
  "What has teeth but cannot eat? (A comb)",
  "What kind of band never plays music? (A rubber band)",
  "I can be stolen or given away and you will live, yet you cannot live without me. What am I? (Heart)",
  "What comes once in a minute, twice in a moment, but never in a thousand years? (The letter M)",
  "What's orange and sounds like a parrot? (A carrot)",
  "What has a head and a tail but no body? (A coin)",
  "I can be cracked, made, told, and played. What am I? (A joke)",
  "What word becomes shorter when you add two letters to it? (Short)",
  "What has a face and two hands but no arms or legs? (A clock)",
  "What has four fingers and one thumb, but is not a hand? (A glove)",
  "I speak without a mouth and hear without ears. I have no body, but I come alive with the wind. What am I? (An echo)",
  "What type of cheese is made backwards? (Edam)",
  "What's full of holes but still holds water? (A sponge)",
  "I can be written, I can be spoken, I can be exposed, I can be broken. What am I? (News)",
  "What is full of holes but can still hold liquid? (A sponge)",
  "What has keys but can't open locks? (A piano)",
  "What goes up but never comes down? (Your age)",
  "What has a ring but no finger? (A telephone)",
  "What has a face and two hands but no body? (A clock)",
  "What begins with T, finishes with T and has T in it? (A teapot)",
  "What has to be broken before you can use it? (An egg)",
  "What can be broken but never held? (A promise)",
  "I am a word of letters three, add two and fewer there will be. What am I? (Few)",
  "What is in seasons, seconds, centuries and minutes but not in decades, years or days? (The letter 'n')",
  "What can you hold without ever touching, or using your hands? (Your breath)",
  "If you throw me from the window, I will leave a grieving wife. Bring me back, but in the door, and You'll see someone giving life! What am I? (The letter 'n')",
  "What gets sharper the more you use it? (Your brain)",
  "I am taken from a mine, and shut up in a wooden case, from which I am never released, and yet I am used by almost every person. What am I? (A pencil)",
  "What has to be broken before it can be used? (An egg)",
  "What is as light as a feather, but even the strongest man cannot hold it for much long? (Breath)",
  "What is as big as an elephant but weighs nothing at all? (The elephant’s shadow)",
  "I am not alive, but I can grow; I don't have lungs, but I need air; I don't have a mouth, but water kills me. What am I? (Fire)",
  "Which letter of the alphabet has the most water? (The C)",
  "What goes in dry and hard, but comes out wet and soft? (Pasta)",
  "What is seen in the middle of March and April that can't be seen at the beginning or end of either month? (The letter 'R')",
  "What is so fragile that saying its name breaks it? (Silence)",
  "What begins and has no end? What is the ending of all that begins? (The letter 'e')",
  "What has many keys, but can't open a single lock? (A piano)",
  "You saw me where I never was and where I could not be. And yet within that very place, my face you often see. What am I? (A reflection)",
  "If you drop me I'm sure to crack, but give me a smile and I'll always smile back. What am I? (A mirror)",
  "I am not alive but I grow. I don't have lungs but I need air. What am I? (Fire)",
  "What starts with a ‘P’ and ends with an ‘E’ and has a million letters in it? (Post Office)",
  "What begins with an E but only has one letter? (An envelope)",
  "You see a house with two doors. One door leads to certain death and the other door leads to life. There are two guards, one in front of each door. One guard always tells the truth and the other always lies. You do not know which guard is which, nor which door leads to life. You can ask one question to one of the guards. What is the question that will lead you to life? (You ask one guard what the other guard would say is the door to life. Then, choose the opposite door.)",
  "I have cities, but no houses. I have mountains, but no trees. I have water, but no fish. What am I? (A map)",
  "What comes once in a minute, twice in a moment, but never in a thousand years? (The letter 'm')",
  "What five-letter word becomes shorter when you add two letters to it? (Short)",
  "I'm full of keys but I can't open any door. What am I? (A piano)",
  "What travels around the world but stays in one spot? (A stamp)",
  "I am a protector of the score. I'm a digit but not a number. What am I? (A goalie)",
  "What is at the end of a rainbow? (The letter 'W')",
  "A man who was outside in the rain without an umbrella or hat didn’t get a single hair on his head wet. Why? (He was bald)",
  "What has legs but can't walk? (A table)",
  "What can run but can’t walk? (Water)",
  "I fly without wings, I cry without eyes. Wherever I go, darkness follows me. What am I? (Cloud)",
  "I'm white, perfect for cutting and grinding. For most animals I am a useful tool. What am I? (Teeth)",
  "A word I know, six letters it contains, subtract just one and twelve is what remains. What is it? (Dozens)",
  "What has many hearts, but no other organs? (A deck of cards)",
  "I am a fruit, I am tasty solutions. If you remove my first letter, I am a crime. If you remove my first two letters, I am an animal. If you remove my first and last letters, I am a form of music. What am I? (Grape)",
  "What can you make that no one—not even you—can see? (A noise)",
  "What has an eye but can't see? (A needle)",
  "What kind of house weighs the least? (A lighthouse)",
  "I am not alive, but I grow; I don't have lungs, but I need air; I don't have a mouth, but water kills me. What am I? (Fire)",
  "What kind of room has no doors or windows? (A mushroom)",
  "What goes up when the rain comes down? (An umbrella)",
  "What kind of dog keeps the best time? (A watchdog)",
  "What has a neck but no head? (A bottle)"
]