[
  "Try to turn someone on without touching them.",
  "Twerk for a minute.",
  "Whisper a secret in someone's ear that your mother would be shocked to hear.",
  "Demonstrate how you would seduce someone without touching them.",
  "Tell your most embarrassing date story.",
  "Tell the sexiest dream you've ever had.",
  "Take a sexy selfie in the bathroom.",
  "Tell the group your favorite position without using words.",
  "Do an impression of a celebrity's sultry voice.",
  "Share the most awkward romantic encounter you've ever had.",
  "Use the most cheesy pickup line on a person of your choice in the room.",
  "Put a hickey on a piece of fruit.",
  "Imitate a sexy music video.",
  "Show everyone the sexiest selfie you have on your phone.",
  "Post a slightly embarrassing picture of yourself on social media.",
  "Describe the first time you had feelings for someone.",
  "Show everyone the first photo in your phone's photo gallery.",
  "Act out a romantic scene from a movie with a pillow.",
  "Tell the group what you think is the sexiest thing about yourself.",
  "Do a steamy version of the Macarena.",
  "Role play a sexy scene from a movie with someone in the room.",
  "Give someone a lap dance without touching them.",
  "Confess who you're most attracted to in the room.",
  "Act out your favorite 'sexy' movie scene.",
  "Run your fingers seductively through the hair of the person next to you.",
  "Try to perform a scene from Fifty Shades of Grey.",
  "Lick your elbow while doing a sexy dance.",
  "Give a presentation on how to do a strip tease.",
  "Explain your weirdest turn-on.",
  "Whisper the three magic words into someone's ear.",
  "Blow a seductive kiss to the person opposite you.",
  "Pretend to be a sexy vampire biting a victim.",
  "Recite a romantic poem for the person to your left.",
  "Create a new sexy dance move and demonstrate it.",
  "Pretend to be a bodybuilder and flex your muscles in a sexy way.",
  "Draw a tattoo with marker on your bicep.",
  "Put on a pair of boxers or briefs over your clothes and walk around the room.",
  "Dance with no music for one minute.",
  "Try to seduce a member of the same sex in the group.",
  "Smell everyone's feet and rank them from best to worst.",
  "Imitate a character from a romance novel.",
  "Show the sexiest body part on your body.",
  "Tell a two-minute story about the craziest thing you've done in bed.",
  "Pretend to be a sexy cowboy or cowgirl.",
  "Show everyone how you'd flirt with someone at a bar.",
  "Describe how you feel right now without using words, but only using sounds and gestures.",
  "Describe your idea of a perfect date, but make it as risqué as possible.",
  "Play 'foot massage' with the person on your right.",
  "Take off your shirt using only your teeth.",
  "Tell everyone an intimate secret about yourself.",
  "Play a song on your body as if it's an instrument.",
  "Use the most sensual voice to tell a mundane story.",
  "Do a model runway walk outside on the sidewalk.",
  "Imitate a striptease for a minute.",
  "Whisper the naughtiest thing you can think of into someone's ear.",
  "Describe the last dream you had about a member of the group.",
  "Kiss the person on your right without any context.",
  "Share the most uncomfortable place you've ever had sex.",
  "Read a sexy story out loud.",
  "Choose someone in the group to give a full body massage (only if it's okay and not making anyone uncomfortable).",
  "Do your sexiest crawl.",
  "Pretend you're at a photo shoot for a sexy magazine.",
  "Give a detailed tutorial on how to put on a condom using a cucumber or banana.",
  "Demonstrate how you flirt without words.",
  "Describe your ideal partner in a very detailed and explicit way.",
  "Draw a picture of your ideal partner naked.",
  "Share your secret technique for attracting someone's attention.",
  "Put lipstick on the person to your left, blindfolded.",
  "Demonstrate your most suggestive dance move.",
  "Share the name of the celebrity you would most like to hook up with.",
  "Take a suggestive selfie and send it to your partner (or pretend to, if not appropriate).",
  "Attempt to pole dance with an imaginary pole.",
  "Tell everyone who you'd marry, kill, and sleep with in the group.",
  "Recreate a scene from Magic Mike.",
  "Use body language to depict your last romantic encounter.",
  "Pretend to be a sexy spy and do a stealth walk.",
  "Share the most risqué text you've ever sent or received.",
  "Play 'sexy or not' with random objects in the room.",
  "Do your best impersonation of a sexy librarian.",
  "Do a seductive dance in the room for two minutes.",
  "Play seven minutes in heaven with the person to your right.",
  "Recreate your O-face.",
  "Act out an X-rated version of a famous scene from a Shakespeare play.",
  "Recite a love letter in a foreign accent.",
  "Sing a romantic song in the most seductive way possible.",
  "Try to make everyone in the room blush.",
  "Share your wildest fantasy.",
  "Use the most seductive voice and order a pizza.",
  "Wear your underwear on the outside of your clothes for the rest of the game.",
  "Show off your most attractive feature.",
  "Write a raunchy two-sentence story and send it to a friend.",
  "Perform a lap dance on a pillow.",
  "Make the most seductive face you can and hold it for 30 seconds.",
  "Put on a pair of high heels and walk.",
  "Demonstrate your best technique for a French kiss using your hand.",
  "Seductively eat a piece of fruit.",
  "Call an ex and tell them you still have feelings for them (only if this won't cause real-life issues).",
  "Try to unhook a bra with one hand (with consent and without actually doing it if not appropriate).",
  "Perform an act from a famous romantic scene in a movie.",
  "Demonstrate your best technique for a passionate kiss on your hand."
]